app/mailers/user_mailer.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def attendance_email(user)
      #on récupère l'instance user pour ensuite pouvoir la passer à la view en @user
        @user = User.find(user.user_id)
        @event = Event.find(user.event_id)